Revit 2026 API

# RebarSpliceUtilsSpliceRebar(Document, ElementId, RebarSpliceOptions, IListRebarSpliceGeometry) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<ElementId> SpliceRebar(
	Document document,
	ElementId rebarIdToSplit,
	RebarSpliceOptions spliceOptions,
	IList<RebarSpliceGeometry> spliceGeometries
)
```
```vb
Public Shared Function SpliceRebar (
	document As Document,
	rebarIdToSplit As ElementId,
	spliceOptions As RebarSpliceOptions,
	spliceGeometries As IList(Of RebarSpliceGeometry)
) As IList(Of ElementId)
```
```cpp
public:
static IList<ElementId^>^ SpliceRebar(
	Document^ document,
	ElementId^ rebarIdToSplit,
	RebarSpliceOptions^ spliceOptions,
	IList<RebarSpliceGeometry^>^ spliceGeometries
)
```
```fsharp
static member SpliceRebar :
        document : Document *
        rebarIdToSplit : ElementId *
        spliceOptions : RebarSpliceOptions *
        spliceGeometries : IList<RebarSpliceGeometry> -> IList<ElementId>
```

#### Parameters

document Document

rebarIdToSplit ElementId

spliceOptions RebarSpliceOptions

spliceGeometries IListRebarSpliceGeometry

#### Return Value

IListElementId

#### Reference

RebarSpliceUtils Class

SpliceRebar Overload

Autodesk.Revit.DB.Structure Namespace